Step1: Identify and Handle Missing Values 

1.Missing ages and replaces with average age of the users. 

2.Missing weight and height are replaced with the average of those values.

3.Missing values in 'purchases' are replaced with a number that we can decide later. 'None should be 0 assume it didn't buy'

In [1]:
import json
import pandas as pd
import numpy as np

In [2]:
#import data
df = pd.read_json('./data/data.json')

In [3]:
df.head()

    user    age  height_cm  weight_kg        purchases  income
0  User1   25.0      175.0       70.0  [1, 0, 2, None]   40000
1  User2    NaN      160.0        NaN  [0, 1, None, 3]   25000
2  User3   35.0        NaN       85.0  [None, 2, 1, 0]   70000
3  User4   50.0      180.0       95.0  [3, None, 2, 1]   50000
4  User5  150.0      170.0      200.0     [2, 1, 0, 3]  120000

In [4]:
# change name 'nan' to 'None'
df = df.replace({None: np.nan})

In [5]:
df.head()

    user    age  height_cm  weight_kg        purchases  income
0  User1   25.0      175.0       70.0  [1, 0, 2, None]   40000
1  User2    NaN      160.0        NaN  [0, 1, None, 3]   25000
2  User3   35.0        NaN       85.0  [None, 2, 1, 0]   70000
3  User4   50.0      180.0       95.0  [3, None, 2, 1]   50000
4  User5  150.0      170.0      200.0     [2, 1, 0, 3]  120000

In [6]:
#1.1 1.2 calculate average
average_age = df['age'].mean()
average_height = df['height_cm'].mean()
average_weight = df['weight_kg'].mean()

In [7]:
print(average_age)
print(average_height)
print(average_weight)

65.0
171.25
112.5

In [8]:
#1.1 1.2 fill in the missing value 
df['age']= df['age'].fillna(round(average_age)) 
df['height_cm']= df['height_cm'].fillna(round(average_height))
df['weight_kg']= df['weight_kg'].fillna(round(average_weight))

In [9]:
df.head()

    user    age  height_cm  weight_kg        purchases  income
0  User1   25.0      175.0       70.0  [1, 0, 2, None]   40000
1  User2   65.0      160.0      112.0  [0, 1, None, 3]   25000
2  User3   35.0      171.0       85.0  [None, 2, 1, 0]   70000
3  User4   50.0      180.0       95.0  [3, None, 2, 1]   50000
4  User5  150.0      170.0      200.0     [2, 1, 0, 3]  120000

In [10]:
#1.3 clean data 如果p是none. 就是0
def clean_purchases(purchases):
    return [0 if p is None else p for p in purchases]

#1.3 apply the 0 to purchases
df['purchases'] = df['purchases'].apply(clean_purchases)

df.head()

    user    age  height_cm  weight_kg     purchases  income
0  User1   25.0      175.0       70.0  [1, 0, 2, 0]   40000
1  User2   65.0      160.0      112.0  [0, 1, 0, 3]   25000
2  User3   35.0      171.0       85.0  [0, 2, 1, 0]   70000
3  User4   50.0      180.0       95.0  [3, 0, 2, 1]   50000
4  User5  150.0      170.0      200.0  [2, 1, 0, 3]  120000

Step 2: Processing Outliers

In [11]:
#setting a bonder/rule here
max_age = 100
max_weight = 150

In [12]:
#replace any value that over max value
#using lamda

df['age'] = df['age'].apply(lambda x: min(x, max_age))
df['weight_kg'] = df['weight_kg'].apply(lambda x: min(x, max_weight))

df.head()

    user    age  height_cm  weight_kg     purchases  income
0  User1   25.0      175.0       70.0  [1, 0, 2, 0]   40000
1  User2   65.0      160.0      112.0  [0, 1, 0, 3]   25000
2  User3   35.0      171.0       85.0  [0, 2, 1, 0]   70000
3  User4   50.0      180.0       95.0  [3, 0, 2, 1]   50000
4  User5  100.0      170.0      150.0  [2, 1, 0, 3]  120000

Step 3: Normallizaing the Data

In [13]:
#start with maximum value 
# #using pandas
max_height = df['height_cm'].max()
max_weight = df['weight_kg'].max()
max_income = df['income'].max()

In [14]:
#if the max value is 0, diveded by 0 will be a problem, so need change to 1
max_height = max_height if max_height !=0 else 1
max_weight = max_weight if max_weight !=0 else 1
max_income = max_income if max_income !=0 else 1

In [15]:
# divide by maximum value 
df['height_cm'] = df['height_cm'] / max_height
df['weight_kg'] = df['weight_kg'] / max_weight
df['income'] = df['income'] / max_income

In [16]:
# see the normalization data
df[['user','height_cm','weight_kg', 'income']].head()

    user  height_cm  weight_kg    income
0  User1   0.972222   0.466667  0.333333
1  User2   0.888889   0.746667  0.208333
2  User3   0.950000   0.566667  0.583333
3  User4   1.000000   0.633333  0.416667
4  User5   0.944444   1.000000  1.000000

One-hot-encoding #if we have a gender female and male

In [17]:
#replace gender to  0,1
#df['gender'] = df['gender'].apply(lambda g: [1,0] if g == 'male' else [0,1])

Save file

In [18]:
#save file
df_new = './data/cleaned_data.json'
df.to_json(df_new, orient='records', indent=4)

print(f'The cleaned data has been saved to:{df_new}')

The cleaned data has been saved to:./data/cleaned_data.json